// var name = 'Василий',
//     admin;
// admin = name;
// alert(admin);
// console.log(admin);

// alert(null || (2 && 3) || 4)

// && - ищет первое ложное значение, если ложного значения нет, выбирает последнее правдивое
// || -ищет первое правдивое значение, есди таких нет, возвращает последнее ложное

// alert(13 % 5); //3

// if  (x % 2 = 0) // even(Четное)


// оператор нулевого слияния не считывает только null или undefined

// alert(alert(1));

let a = 3,
    b = 5,
    c = 1,
    d;

c = ++a; // a = 4, c = 4
d = b++; // b = 6, d = 5
c = (2 + ++a) // a = 5, c = 7
d = (3 + b++) // b = 7, d = 9
a; // a = 5
b; // b = 7